# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"

# Brews
brew "antigen"
brew "fasd"
brew "ffmpeg"
brew "git"
brew "imagemagick"
brew "mas"
brew "openssl"
brew "rbenv"
brew "ruby-build"
brew "stow"
brew "tree"
brew "wget"
brew "youtube-dl"

# Design Tools
mas "xScope", id: 889428659
cask "sf-symbols"

# Development Tools
cask "choosy"
cask "dash"
cask "fork"
cask "imageoptim"
cask "visual-studio-code"
brew "svgo"

# Development Browsers
cask "firefox"
cask "firefox-developer-edition"
cask "google-chrome"
cask "google-chrome-canary"
cask "microsoft-edge"
cask "opera"

# Apps
cask "alfred"
cask "cleanshot"
cask "focus"
cask "omnifocus"
cask "tripmode"
mas "1Password 7", id: 1333542190
mas "Deliveries", id: 924726344
mas "Drafts", id: 1435957248
mas "Instapaper", id: 1481302432
mas "Lungo", id: 1263070803
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "ToothFairy", id: 1191449274
mas "WhatsApp", id: 1147396723
mas "Yoink", id: 457622435
