# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"

# Brews
brew "antigen"
brew "fasd"
brew "git"
brew "openssl"
brew "stow"
brew "tree"
brew "wget"
brew "youtube-dl"

# Utilities
cask "backblaze"
cask "logitech-options"

# Design Tools
cask "sf-symbols"
cask "imageoptim"
cask "sketch"
cask "figma"
cask "framer"

# Apps
cask "cleanshot"
cask "fantastical"
cask "flotato"
cask "hazel"
cask "raycast"
cask "signal"
cask "slack"
cask "tripmode"

# Development Browsers
cask "firefox"
cask "google-chrome"
cask "microsoft-edge"
cask "opera"

# Code
cask "github"
cask "visual-studio-code"

# 'mas' doesn't work in recent macOS versions
# brew "mas"
# mas "xScope 4", id: 889428659
# mas "Deliveries", id: 924726344
# mas "Lungo", id: 1263070803
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
# mas "Things 3", id: 904280696
# mas "Tot", id: 1491071483
# mas "WhatsApp", id: 1147396723
# mas "Yoink", id: 457622435
# mas "Xcode", id: 497799835
