# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"

# Brews
brew "antigen"
brew "fasd"
brew "ffmpeg"
brew "git"
brew "imagemagick"
brew "mas"
brew "openssl"
brew "stow"
brew "tree"
brew "wget"
brew "youtube-dl"

# Utilities
cask "backblaze"
cask "logitech-options"

# Design Tools
mas "xScope 4", id: 889428659
cask "sf-symbols"
cask "imageoptim"
cask "sketch"
cask "figma"
cask "framer"

# Code
mas "Xcode", id: 497799835
cask "github"

# Development Browsers
cask "firefox"
cask "google-chrome"
cask "microsoft-edge"
cask "opera"

# Apps
cask "cleanshot"
cask "flotato"
cask "hazel"
cask "raycast"
cask "signal"
cask "slack"
cask "tripmode"
mas "1Password 7", id: 1333542190
mas "Deliveries", id: 924726344
mas "Lungo", id: 1263070803
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Things 3", id: 904280696
mas "Tot", id: 1491071483
mas "WhatsApp", id: 1147396723
mas "Yoink", id: 457622435
